; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

(not-boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

(not-served ?person - passenger)
;; true if ?person is not at their destination

(lift-at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding

(:action board
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (origin ?p ?f))
  :effect (boarded ?p))

(:action depart
  :parameters (?f - floor ?p - passenger)
  :precondition (and (lift-at ?f) (destin ?p ?f)
		     (boarded ?p))
  :effect (and (not (boarded ?p))
	       (served ?p)))
;;drive up

(:action up
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f1 ?f2))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))


;;drive down

(:action down
  :parameters (?f1 - floor ?f2 - floor)
  :precondition (and (lift-at ?f1) (above ?f2 ?f1))
  :effect (and (lift-at ?f2) (not (lift-at ?f1))))
)

; problem
(define (problem miconic-53)
 (:domain miconic)
 (:objects 
    p1 p2 p3 p4 p5 - passenger
    f1 f2 f3 f4 f5 f6 f7 f8 f9 f10 f11 - floor
    )
 (:init 
    (lift-at f5)
    (origin p1 f7)
    (destin p1 f10)
    (origin p2 f7)
    (destin p2 f6)
    (origin p3 f6)
    (destin p3 f10)
    (origin p4 f7)
    (destin p4 f6)
    (origin p5 f1)
    (destin p5 f10)
    (above f1 f2)
    (above f1 f3)
    (above f1 f4)
    (above f1 f5)
    (above f1 f6)
    (above f1 f7)
    (above f1 f8)
    (above f1 f9)
    (above f1 f10)
    (above f1 f11)
    (above f2 f3)
    (above f2 f4)
    (above f2 f5)
    (above f2 f6)
    (above f2 f7)
    (above f2 f8)
    (above f2 f9)
    (above f2 f10)
    (above f2 f11)
    (above f3 f4)
    (above f3 f5)
    (above f3 f6)
    (above f3 f7)
    (above f3 f8)
    (above f3 f9)
    (above f3 f10)
    (above f3 f11)
    (above f4 f5)
    (above f4 f6)
    (above f4 f7)
    (above f4 f8)
    (above f4 f9)
    (above f4 f10)
    (above f4 f11)
    (above f5 f6)
    (above f5 f7)
    (above f5 f8)
    (above f5 f9)
    (above f5 f10)
    (above f5 f11)
    (above f6 f7)
    (above f6 f8)
    (above f6 f9)
    (above f6 f10)
    (above f6 f11)
    (above f7 f8)
    (above f7 f9)
    (above f7 f10)
    (above f7 f11)
    (above f8 f9)
    (above f8 f10)
    (above f8 f11)
    (above f9 f10)
    (above f9 f11)
    (above f10 f11)
)
 (:goal (and 
(served p4)
(served p2)
(served p5)
))
)

; plan
1. (down f5 f1)
   deleted: (lift-at f5)
   added: (lift-at f1)
   goals met: 0 of 3
2. (board f1 p5)
   added: (boarded p5)
   goals met: 0 of 3
3. (up f1 f10)
   deleted: (lift-at f1)
   added: (lift-at f10)
   goals met: 0 of 3
4. (depart f10 p5)
   deleted: (boarded p5)
   added: (served p5)
   goals met: 1 of 3
5. (down f10 f7)
   deleted: (lift-at f10)
   added: (lift-at f7)
   goals met: 1 of 3
6. (board f7 p4)
   added: (boarded p4)
   goals met: 1 of 3
7. (board f7 p2)
   added: (boarded p2)
   goals met: 1 of 3
8. (down f7 f6)
   deleted: (lift-at f7)
   added: (lift-at f6)
   goals met: 1 of 3
9. (depart f6 p4)
   deleted: (boarded p4)
   added: (served p4)
   goals met: 2 of 3
10. (depart f6 p2)
   deleted: (boarded p2)
   added: (served p2)
   goals met: 3 of 3
